podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/AXBS_MK82F25615.svd.xml
            <register>
               <name>MGPCR4</name>
               <description>Master General Purpose Control Register</description>
               <addressOffset>0xC00</addressOffset>
               <fields>
                  <field>
                     <name>AULB</name>
                     <description>Arbitrates On Undefined Length Bursts</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>No arbitration is allowed during an undefined length burst</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>Arbitration is allowed at any time during an undefined length burst</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Arbitration is allowed after four beats of an undefined length burst</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Arbitration is allowed after eight beats of an undefined length burst</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Arbitration is allowed after 16 beats of an undefined length burst</description>
                           <value>0b100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
